spec/cassettes/stripe/transfer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/transfers
    body:
      encoding: US-ASCII
      string: amount=14000&currency=usd&recipient=rp_2FUrV5Zn4ILgfo&statement_descriptor=Ruby%20Fundamentals
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_xlf81Tc7EFDDps6VCBue3N2d
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"2.0.0 p195 (2013-05-14)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        AfricaBook.local 12.5.0 Darwin Kernel Version 12.5.0: Sun Sep 29 13:33:47
        PDT 2013; root:xnu-2050.48.12~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '94'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 25 Nov 2013 14:21:12 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '601'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tr_30R66cgQez9wiM",
          "object": "transfer",
          "date": 1385389272,
          "livemode": false,
          "amount": 14000,
          "currency": "usd",
          "status": "pending",
          "balance_transaction": "txn_30R6FwxC7RV3zg",
          "account": {
            "object": "bank_account",
            "id": "ba_2FUrVq95xPgHX7",
            "bank_name": "STRIPE TEST BANK",
            "last4": "6789",
            "country": "US",
            "currency": "usd",
            "validated": false,
            "verified": false,
            "fingerprint": "YF4diEg98Ji8d7n2"
          },
          "description": null,
          "metadata": {},
          "statement_descriptor": "Ruby Fundamentals",
          "recipient": "rp_2FUrV5Zn4ILgfo"
        }
    http_version: 
  recorded_at: Mon, 25 Nov 2013 14:21:13 GMT
recorded_with: VCR 2.5.0
