spec/vcr_cassettes/stripe/transfer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/transfers
    body:
      encoding: US-ASCII
      string: amount=14000&currency=usd&recipient=rp_2FUrV5Zn4ILgfo&statement_descriptor=Ruby%20Fundamentals
    headers:
      accept:
      - ! '*/*; q=0.5, application/xml'
      accept-encoding:
      - gzip, deflate
      user-agent:
      - Stripe/v1 RubyBindings/1.8.3
      authorization:
      - Bearer sk_test_xlf81Tc7EFDDps6VCBue3N2d
      content-type:
      - application/x-www-form-urlencoded
      x-stripe-client-user-agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p231 (2012-05-25)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Shays-MacBook-Air.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
      content-length:
      - '94'
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - nginx
      date:
      - Tue, 23 Jul 2013 07:10:57 GMT
      content-type:
      - application/json;charset=utf-8
      content-length:
      - '654'
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"tr_2FUwJSkbFtQhDY\",\n  \"object\": \"transfer\",\n
        \ \"date\": 1374563456,\n  \"livemode\": false,\n  \"amount\": 14000,\n  \"currency\":
        \"usd\",\n  \"status\": \"pending\",\n  \"fee\": 25,\n  \"fee_details\": [\n
        \   {\n      \"amount\": 25,\n      \"currency\": \"usd\",\n      \"type\":
        \"stripe_fee\",\n      \"description\": \"Stripe processing fees\",\n      \"application\":
        null\n    }\n  ],\n  \"account\": {\n    \"object\": \"bank_account\",\n    \"bank_name\":
        \"STRIPE TEST BANK\",\n    \"last4\": \"6789\",\n    \"country\": \"US\",\n
        \   \"validated\": false,\n    \"fingerprint\": \"YF4diEg98Ji8d7n2\"\n  },\n
        \ \"description\": null,\n  \"statement_descriptor\": \"Ruby Fundamentals\",\n
        \ \"recipient\": \"rp_2FUrV5Zn4ILgfo\"\n}\n"
    http_version: '1.1'
  recorded_at: Tue, 23 Jul 2013 07:11:01 GMT
recorded_with: VCR 2.5.0
